zsh-utilities-work.org
#+TITLE:  Zsh Utilities Work
#+AUTHOR: Xavier Garrido
#+DATE:   2013-02-08
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:zsh-utilities.org][Zsh Utilities]].

* Zsh Utilities - Work
This file contains some function/alias in relation with "work" topic.
** pkgtools aliases
=pkgtools= is used as wrapper for installation. It is a bash program which wraps
=cmake= or some =Makefile= and is intensively used with SuperNEMO software.
#+BEGIN_SRC sh
  alias pkg-notify='notify -t 2000 -i stock_dialog-info "pkgtools"'

  function pkgc ()
  {
      ./pkgtools.d/pkgtool configure $@ && pkg-notify "Configure done"
  }

  function pkgb ()
  {
      ./pkgtools.d/pkgtool build && pkg-notify "Build done"
  }

  function pkgt ()
  {
      ./pkgtools.d/pkgtool test && pkg-notify "Running test programs done"
  }

  function pkgr ()
  {
      ./pkgtools.d/pkgtool reset && pkg-notify "Reset done"
  }

  function pkgi ()
  {
      ./pkgtools.d/pkgtool install && pkg-notify "Install done"
  }
#+END_SRC

** ROOT aliases
#+BEGIN_SRC sh
  alias root='root -l'
#+END_SRC

** SN@ilWare aliases
*** Setup
#+BEGIN_SRC sh
  alias do_nemo_setup='aggregator setup cadfael'
  alias do_snailware_setup='do_nemo_setup && snailware setup all && mkdir -p /tmp/${USER}/snemo.d'
#+END_SRC

*** Working configuration
Legacy configuration load the =legacy= svn branch to work with a full software
installation. Bayeux components are ordered by dependency and since there is a
change wrt to =geomtools= vs. =materials= dependency as well as =genbb_help=
depending on =dpp= for programs, we have to set the full list of Bayeux
components.
#+BEGIN_SRC sh
  alias build_snailware_legacy='do_nemo_setup && snailware setup channel && \
  snailware git-branch --branch legacy datatools mygsl geomtools materials brio cuts genbb_help genvtx trackfit emfield && \
  snailware git-branch --branch legacy sngeometry sncore sngenvertex sngenbb sng4 snreconstruction snvisualization snanalysis && \
  snrebuild datatools mygsl geomtools materials brio cuts genbb_help genvtx trackfit emfield && \
  snrebuild sngeometry sncore sngenvertex sngenbb sng4 snreconstruction snvisualization snanalysis'
  alias build_snailware_master='do_nemo_setup && snailware setup channel && \
  snailware git-branch --branch master bayeux sngeometry sncore snreconstruction snvisualization && \
  snailware git-branch --branch xg_devel snanalysis && \
  snrebuild bayeux falaise'
#+END_SRC

*** =dpp_processing= shortcuts
#+BEGIN_SRC sh
  function do_snemo_chain ()
  {
      __pkgtools__at_function_enter do_snemo_chain
      if [ -z $1 ]; then
          pkgtools__msg_error "Missing module name !"
          __pkgtools__at_function_exit
          return 1
      fi
      if pkgtools__has_binary dpp_processing; then
          dpp_processing -m $1 -c $SNAILWARE_SIMULATION_DIR/configuration/current/module_manager.conf \
              -l mctoools_g4 -l mctools_bio \
              -l sngeometry -l sncore -l sncore_bio -l snanalysis -l snanalysis_bio -l snreconstruction \
              -M 100 -% 10
      else
          pkgtools__msg_error "SN@ilWare has not been set"
          __pkgtools__at_function_exit
          return 1
      fi
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC

** Lyon ccali aliases
#+BEGIN_SRC sh
  if [[ $HOSTNAME = ccage* ]]; then
      alias qjob_nemo_user='echo "Number of jobs run by NEMO users"; qstat -u \* -ext -s r| grep nemo | awk "{print \$5}" | sort | uniq -c'
      alias qjob_my_total='echo -ne "Total number of jobs: ";qstat | wc -l'
      alias qjob_my_run='echo -ne "Number of running jobs: ";qstat | awk "{if (\$5 == \"r\") print 1}" | wc -l'
      alias qjob_summary='qjob_my_total; qjob_my_run; qjob_nemo_user'
  fi
#+END_SRC

** Activate g++ warnings
#+BEGIN_SRC sh
  function activate_cxxflags ()
  {
      __pkgtools__at_function_enter activate_cxxflags
      export CXXFLAGS="-Waddress -Warray-bounds -Wc++11-compat -Wchar-subscripts      \
    -Wenum-compare -Wcomment -Wformat -Wmain -Wmaybe-uninitialized -Wmissing-braces \
    -Wnonnull -Wparentheses -Wreorder -Wreturn-type -Wsequence-point -Wsign-compare \
    -Wstrict-aliasing -Wstrict-overflow=1 -Wswitch -Wtrigraphs -Wuninitialized      \
    -Wunknown-pragmas -Wunused-function -Wunused-label -Wunused-value               \
    -Wunused-variable -Wvolatile-register-var -Wclobbered -Wempty-body              \
    -Wignored-qualifiers -Wmissing-field-initializers -Wsign-compare -Wtype-limits  \
    -Wuninitialized -Wunused-parameter -Wunused-but-set-parameter"
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
** Generate talk skeleton
