zsh-utilities-work.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Zsh Utilities Work</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="stylesheets/styles.css">
                <link rel="stylesheet" href="stylesheets/org-pygments.css">
</head>
<body>
<div id="content">
<h1 class="title">Zsh Utilities Work</h1>
<p>
This is part of the <a href="zsh-utilities.html">Zsh Utilities</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Zsh Utilities - Work</h2>
<div class="outline-text-2" id="text-1">
<p>
This file contains some function/alias in relation with "work" topic.
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">pkgtools aliases</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>pkgtools</code> is used as wrapper for installation. It is a bash program which wraps
<code>cmake</code> or some <code>Makefile</code> and is intensively used with SuperNEMO software.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">alias</span> pkg-notify=<span class="org-string">'notify -t 2000 -i stock_dialog-info "pkgtools"'</span>

<span class="org-keyword">function</span> <span class="org-function-name">pkgc</span> ()
{
    ./pkgtools.d/pkgtool configure $<span class="org-variable-name">@</span> &amp;&amp; pkg-notify <span class="org-string">"Configure done"</span>
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgb</span> ()
{
    ./pkgtools.d/pkgtool build &amp;&amp; pkg-notify <span class="org-string">"Build done"</span>
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgt</span> ()
{
    ./pkgtools.d/pkgtool test &amp;&amp; pkg-notify <span class="org-string">"Running test programs done"</span>
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgr</span> ()
{
    ./pkgtools.d/pkgtool reset &amp;&amp; pkg-notify <span class="org-string">"Reset done"</span>
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgi</span> ()
{
    ./pkgtools.d/pkgtool install &amp;&amp; pkg-notify <span class="org-string">"Install done"</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">ROOT aliases</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">root</span>=<span class="org-string">'root -l'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">SN@ilWare aliases</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">Setup</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">do_nemo_setup</span>=<span class="org-string">'aggregator setup cadfael'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">do_snailware_setup</span>=<span class="org-string">'do_nemo_setup &amp;&amp; snailware setup all &amp;&amp; mkdir -p /tmp/${USER}/snemo.d'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">Working configuration</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Legacy configuration load the <code>legacy</code> svn branch to work with a full software
installation. Bayeux components are ordered by dependency and since there is a
change wrt to <code>geomtools</code> vs. <code>materials</code> dependency as well as <code>genbb_help</code>
depending on <code>dpp</code> for programs, we have to set the full list of Bayeux
components.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">build_snailware_legacy</span>=<span class="org-string">'do_nemo_setup &amp;&amp; snailware setup channel &amp;&amp; \</span>
<span class="org-string">snailware git-branch --branch legacy datatools mygsl geomtools materials brio cuts genbb_help genvtx trackfit emfield &amp;&amp; \</span>
<span class="org-string">snailware git-branch --branch legacy sngeometry sncore sngenvertex sngenbb sng4 snreconstruction snvisualization snanalysis &amp;&amp; \</span>
<span class="org-string">snrebuild datatools mygsl geomtools materials brio cuts genbb_help genvtx trackfit emfield &amp;&amp; \</span>
<span class="org-string">snrebuild sngeometry sncore sngenvertex sngenbb sng4 snreconstruction snvisualization snanalysis'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">build_snailware_master</span>=<span class="org-string">'do_nemo_setup &amp;&amp; snailware setup channel &amp;&amp; \</span>
<span class="org-string">snailware git-branch --branch master bayeux sngeometry sncore snreconstruction snvisualization &amp;&amp; \</span>
<span class="org-string">snailware git-branch --branch xg_devel snanalysis &amp;&amp; \</span>
<span class="org-string">snrebuild bayeux falaise'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><code>dpp_processing</code> shortcuts</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">do_snemo_chain</span> ()
{
    __pkgtools__at_function_enter do_snemo_chain
    <span class="org-keyword">if</span> [ -z $<span class="org-variable-name">1</span> ]; <span class="org-keyword">then</span>
        pkgtools__msg_error <span class="org-string">"Missing module name !"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> pkgtools__has_binary dpp_processing; <span class="org-keyword">then</span>
        dpp_processing -m $<span class="org-variable-name">1</span> -c $<span class="org-variable-name">SNAILWARE_SIMULATION_DIR</span>/configuration/current/module_manager.conf <span class="org-sh-escaped-newline">\</span>
            -l mctoools_g4 -l mctools_bio <span class="org-sh-escaped-newline">\</span>
            -l sngeometry -l sncore -l sncore_bio -l snanalysis -l snanalysis_bio -l snreconstruction <span class="org-sh-escaped-newline">\</span>
            -M 100 -% 10
    <span class="org-keyword">else</span>
        pkgtools__msg_error <span class="org-string">"SN@ilWare has not been set"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Lyon ccali aliases</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">if</span> [[ $<span class="org-variable-name">HOSTNAME</span> = ccage* ]]; <span class="org-keyword">then</span>
    <span class="org-builtin">alias</span> <span class="org-variable-name">qjob_nemo_user</span>=<span class="org-string">'echo "Number of jobs run by NEMO users"; qstat -u \* -ext -s r| grep nemo | awk "{print \$5}" | sort | uniq -c'</span>
    <span class="org-builtin">alias</span> <span class="org-variable-name">qjob_my_total</span>=<span class="org-string">'echo -ne "Total number of jobs: ";qstat | wc -l'</span>
    <span class="org-builtin">alias</span> <span class="org-variable-name">qjob_my_run</span>=<span class="org-string">'echo -ne "Number of running jobs: ";qstat | awk "{if (\$5 == \"r\") print 1}" | wc -l'</span>
    <span class="org-builtin">alias</span> <span class="org-variable-name">qjob_summary</span>=<span class="org-string">'qjob_my_total; qjob_my_run; qjob_nemo_user'</span>
<span class="org-keyword">fi</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Activate g++ warnings</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">activate_cxxflags</span> ()
{
    __pkgtools__at_function_enter activate_cxxflags
    <span class="org-builtin">export</span> <span class="org-variable-name">CXXFLAGS</span>=<span class="org-string">"-Waddress -Warray-bounds -Wc++11-compat -Wchar-subscripts      \</span>
<span class="org-string">  -Wenum-compare -Wcomment -Wformat -Wmain -Wmaybe-uninitialized -Wmissing-braces \</span>
<span class="org-string">  -Wnonnull -Wparentheses -Wreorder -Wreturn-type -Wsequence-point -Wsign-compare \</span>
<span class="org-string">  -Wstrict-aliasing -Wstrict-overflow=1 -Wswitch -Wtrigraphs -Wuninitialized      \</span>
<span class="org-string">  -Wunknown-pragmas -Wunused-function -Wunused-label -Wunused-value               \</span>
<span class="org-string">  -Wunused-variable -Wvolatile-register-var -Wclobbered -Wempty-body              \</span>
<span class="org-string">  -Wignored-qualifiers -Wmissing-field-initializers -Wsign-compare -Wtype-limits  \</span>
<span class="org-string">  -Wuninitialized -Wunused-parameter -Wunused-but-set-parameter"</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Generate talk skeleton</h3>
