zsh-utilities-work.html
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">Main function</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">make_new_talk</span> ()
{
    __pkgtools__default_values
    __pkgtools__at_function_enter make_new_talk

    <span class="org-comment-delimiter"># </span><span class="org-comment">Internal functions</span>
    --mnt::usage () {
    }

    <span class="org-builtin">local</span> append_list_of_options
    <span class="org-builtin">local</span> append_list_of_arguments

    <span class="org-builtin">local</span> title
    <span class="org-builtin">local</span> <span class="org-variable-name">author</span>=<span class="org-string">"Xavier Garrido"</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">latex_class</span>=<span class="org-string">"beamer"</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">latex_class_options</span>=<span class="org-string">"snemo,nologo"</span>
    <span class="org-keyword">while</span> [ -n <span class="org-string">"$1"</span> ]; <span class="org-keyword">do</span>
        <span class="org-builtin">local</span> <span class="org-variable-name">token</span>=$<span class="org-variable-name">1</span>
        <span class="org-keyword">if</span> [ <span class="org-string">"${token[0,1]}"</span> = <span class="org-string">"-"</span> ]; <span class="org-keyword">then</span>
            <span class="org-builtin">local</span> <span class="org-variable-name">opt</span>=${<span class="org-variable-name">token</span>}
            <span class="org-variable-name">append_list_of_options</span>+=<span class="org-string">"${opt} "</span>
            <span class="org-keyword">if</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"-h"</span> -o <span class="org-string">"${opt}"</span> = <span class="org-string">"--help"</span> ]; <span class="org-keyword">then</span>
                --mnt::usage
                <span class="org-keyword">return</span> 0
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"-d"</span> -o <span class="org-string">"${opt}"</span> = <span class="org-string">"--debug"</span> ]; <span class="org-keyword">then</span>
                pkgtools__msg_using_debug
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"-D"</span> -o <span class="org-string">"${opt}"</span> = <span class="org-string">"--devel"</span> ]; <span class="org-keyword">then</span>
                pkgtools__msg_using_devel
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"-v"</span> -o <span class="org-string">"${opt}"</span> = <span class="org-string">"--verbose"</span> ]; <span class="org-keyword">then</span>
                pkgtools__msg_using_verbose
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"-W"</span> -o <span class="org-string">"${opt}"</span> = <span class="org-string">"--no-warning"</span> ]; <span class="org-keyword">then</span>
                pkgtools__msg_not_using_warning
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"-q"</span> -o <span class="org-string">"${opt}"</span> = <span class="org-string">"--quiet"</span> ]; <span class="org-keyword">then</span>
                pkgtools__msg_using_quiet
                <span class="org-builtin">export</span> <span class="org-variable-name">PKGTOOLS_MSG_QUIET</span>=1
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"-i"</span> -o <span class="org-string">"${opt}"</span> = <span class="org-string">"--interactive"</span> ]; <span class="org-keyword">then</span>
                pkgtools__ui_interactive
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"-b"</span> -o <span class="org-string">"${opt}"</span> = <span class="org-string">"--batch"</span> ]; <span class="org-keyword">then</span>
                pkgtools__ui_batch
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"--gui"</span> ]; <span class="org-keyword">then</span>
                pkgtools__ui_using_gui
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"--title"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">shift</span> 1; <span class="org-variable-name">title</span>=<span class="org-string">"$1"</span>
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"--author"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">shift</span> 1; <span class="org-variable-name">author</span>=<span class="org-string">"$1"</span>
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"--latex-class"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">shift</span> 1; <span class="org-variable-name">latex_class</span>=<span class="org-string">"$1"</span>
            <span class="org-keyword">elif</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"--latex-class-options"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">shift</span> 1; <span class="org-variable-name">latex_class_options</span>=<span class="org-string">"$1"</span>
            <span class="org-keyword">fi</span>
        <span class="org-keyword">else</span>
            <span class="org-variable-name">arg</span>=${<span class="org-variable-name">token</span>}
            <span class="org-keyword">if</span> [ <span class="org-string">"x${arg}"</span> != <span class="org-string">"x"</span> ]; <span class="org-keyword">then</span>
                <span class="org-variable-name">append_list_of_arguments</span>+=<span class="org-string">"${arg} "</span>
            <span class="org-keyword">fi</span>
        <span class="org-keyword">fi</span>
        <span class="org-builtin">shift</span> 1
    <span class="org-keyword">done</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Remove last space</span>
    <span class="org-variable-name">append_list_of_arguments</span>=${<span class="org-variable-name">append_list_of_arguments</span>%?}
    <span class="org-variable-name">append_list_of_options</span>=${<span class="org-variable-name">append_list_of_options</span>%?}
    pkgtools__msg_devel <span class="org-string">"append_list_of_arguments=${append_list_of_arguments}"</span>
    pkgtools__msg_devel <span class="org-string">"append_list_of_options=${append_list_of_options}"</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Local functions</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">base</span>=~/Workdir/Talk
    <span class="org-builtin">local</span> <span class="org-variable-name">dirname</span>=<span class="org-string">"$(echo ${append_list_of_arguments} | awk '{print $1}')"</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">directory</span>=${<span class="org-variable-name">base</span>}/${<span class="org-variable-name">dirname</span>}

    --mnt::create_directories () {
        mkdir -p ${<span class="org-variable-name">directory</span>}/{pdf,plot}
    }

    --mnt::generate_org_skeleton () {
        <span class="org-builtin">local</span> <span class="org-variable-name">org_file</span>=${<span class="org-variable-name">directory</span>}/talk.org
        <span class="org-builtin">echo</span> <span class="org-string">"#+TITLE:  ${title}"</span>                               &gt; ${<span class="org-variable-name">org_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"#+AUTHOR: ${author}"</span>                             &gt;&gt; ${<span class="org-variable-name">org_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"#+DATE:   $(date +%d/%m/%Y)"</span>                     &gt;&gt; ${<span class="org-variable-name">org_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"#+OPTIONS: toc:nil ^:{}"</span>                         &gt;&gt; ${<span class="org-variable-name">org_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"#+STARTUP: beamer"</span>                               &gt;&gt; ${<span class="org-variable-name">org_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"#+LATEX_CLASS: ${latex_class}"</span>                   &gt;&gt; ${<span class="org-variable-name">org_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"#+LATEX_CLASS_OPTIONS: [${latex_class_options}]"</span> &gt;&gt; ${<span class="org-variable-name">org_file</span>}
    }

    --mnt::generate_makefile () {
        <span class="org-builtin">local</span> <span class="org-variable-name">make_file</span>=${<span class="org-variable-name">directory</span>}/Makefile
        <span class="org-builtin">echo</span> <span class="org-string">"# -*- mode: makefile; -*-"</span>                                         &gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"EMACS=emacs"</span>                                                      &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"BATCH=\$(EMACS) --batch --eval '(setq starter-kit-dir \"~/.emacs.d\")' \</span>
<span class="org-string">                                      --load '~/.emacs.d/starter-kit-org.el'"</span>   &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"files_org = \$(wildcard *.org)"</span>                                   &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"files_pdf = \$(files_org:.org=.pdf)"</span>                              &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span>                                                                    &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"all: \$(files_pdf)"</span>                                               &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span>                                                                    &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"%.pdf: %.org"</span>                                                     &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"\t@echo \"NOTICE: Exporting \$&lt; to pdf...\";"</span>                     &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"\t@\$(BATCH) --visit \"\$&lt;\" --funcall org-beamer-export-to-pdf"</span>  &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"\t@cp \$@ pdf/\${@:.pdf=_${dirname}.pdf}"</span>                         &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span>                                                                    &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"clean:"</span>                                                           &gt;&gt; ${<span class="org-variable-name">make_file</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"\t@rm -rf latex.d *.tex *.pdf *.fdb* *~"</span>                          &gt;&gt; ${<span class="org-variable-name">make_file</span>}
    }

    --mnt::generate_gitignore () {
        <span class="org-builtin">local</span> <span class="org-variable-name">gitignore</span>=${<span class="org-variable-name">directory</span>}/.gitignore
        <span class="org-builtin">echo</span> <span class="org-string">"/talk*.pdf"</span>         &gt;&gt; ${<span class="org-variable-name">gitignore</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"/talk*.tex"</span>         &gt;&gt; ${<span class="org-variable-name">gitignore</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"/talk*.auxlock"</span>     &gt;&gt; ${<span class="org-variable-name">gitignore</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"/talk*.vrb"</span>         &gt;&gt; ${<span class="org-variable-name">gitignore</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"/talk*.fdb_latexmk"</span> &gt;&gt; ${<span class="org-variable-name">gitignore</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"/talk*.fls"</span>         &gt;&gt; ${<span class="org-variable-name">gitignore</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"/talk*.aux"</span>         &gt;&gt; ${<span class="org-variable-name">gitignore</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"*~"</span>            &gt;&gt; ${<span class="org-variable-name">gitignore</span>}
        <span class="org-builtin">echo</span> <span class="org-string">"latex.d/"</span>      &gt;&gt; ${<span class="org-variable-name">gitignore</span>}
      }

    --mnt::import_talk () {
        (
            <span class="org-keyword">if</span> [ -d ${<span class="org-variable-name">directory</span>}/.git ]; <span class="org-keyword">then</span>
                pkgtools__msg_warning <span class="org-string">"Directory '${directory}' is already under git-svn !"</span>
                <span class="org-keyword">return</span> 0
            <span class="org-keyword">fi</span>
            svn mkdir https://svn.lal.in2p3.fr/users/garrido/Talk/${<span class="org-variable-name">dirname</span>} -m <span class="org-string">"create ${dirname} directory"</span>
            svn import ${<span class="org-variable-name">directory</span>} https://svn.lal.in2p3.fr/users/garrido/Talk/${<span class="org-variable-name">dirname</span>} -m <span class="org-string">"import trunk directory"</span>
            rm -rf ${<span class="org-variable-name">base</span>}/${<span class="org-variable-name">dirname</span>}
            mkdir -p ${<span class="org-variable-name">base</span>}/${<span class="org-variable-name">dirname</span>}
            <span class="org-builtin">cd</span> ${<span class="org-variable-name">base</span>}/${<span class="org-variable-name">dirname</span>}
            git svn init --prefix=svn/ --trunk=. https://svn.lal.in2p3.fr/users/garrido/Talk/${<span class="org-variable-name">dirname</span>}
            git svn fetch
        )
    }

    <span class="org-keyword">if</span> [ <span class="org-string">"${dirname}"</span> = <span class="org-string">""</span> ]; <span class="org-keyword">then</span>
        pkgtools__msg_error <span class="org-string">"You must give a repository name !"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>

    --mnt::create_directories
    --mnt::generate_org_skeleton
    --mnt::generate_makefile
    --mnt::generate_gitignore
    --mnt::import_talk

    <span class="org-comment-delimiter"># </span><span class="org-comment">Finally goto the directory</span>
    <span class="org-builtin">cd</span> ${<span class="org-variable-name">base</span>}/${<span class="org-variable-name">dirname</span>}

    <span class="org-builtin">unset</span> title author latex_class latex_class_options
    <span class="org-builtin">unset</span> dirname directory base
    <span class="org-builtin">unset</span> append_list_of_arguments append_list_of_options
    <span class="org-builtin">unfunction</span> -- --mnt::usage
    <span class="org-builtin">unfunction</span> -- --mnt::generate_org_skeleton
    <span class="org-builtin">unfunction</span> -- --mnt::create_directories
    <span class="org-builtin">unfunction</span> -- --mnt::import_talk
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
